Eloise-wang/BLE_DataCollection_New/ZKFJ_BLE_wireless_uart_freertos/board/pin_mux.h
/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

#define PCR_ODE_ode0 0x00u /*!<@brief Open Drain Enable: Disables */
#define PCR_PE_pe0 0x00u   /*!<@brief Pull Enable: Disables */
#define PCR_PFE_pfe0 0x00u /*!<@brief Passive Filter Enable: Disables */
#define PCR_PS_ps0 0x00u   /*!<@brief Pull Select: Enables internal pulldown resistor */
#define PCR_PS_ps1 0x01u   /*!<@brief Pull Select: Enables internal pullup resistor */

/*! @name PORTD1 (number 24), Send_LED
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINBUTTON0_Send_LED_GPIO GPIOD               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINBUTTON0_Send_LED_GPIO_PIN_MASK (1U << 1U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINBUTTON0_Send_LED_PORT PORTD               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINBUTTON0_Send_LED_PIN 1U                   /*!<@brief PORT pin number */
#define BOARD_INITPINBUTTON0_Send_LED_PIN_MASK (1U << 1U)      /*!<@brief PORT pin mask */
                                                               /* @} */

/*! @name PORTA21 (number 18), pressure
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINBUTTON0_pressure_PORT PORTA                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINBUTTON0_pressure_PIN 21U                   /*!<@brief PORT pin number */
#define BOARD_INITPINBUTTON0_pressure_PIN_MASK (1U << 21U)      /*!<@brief PORT pin mask */
                                                                /* @} */

/*! @name PORTA20 (number 17), temp
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINBUTTON0_temp_PORT PORTA                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINBUTTON0_temp_PIN 20U                   /*!<@brief PORT pin number */
#define BOARD_INITPINBUTTON0_temp_PIN_MASK (1U << 20U)      /*!<@brief PORT pin mask */
                                                            /* @} */

/*! @name PORTB5 (number 3), Electricity_LED
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINBUTTON0_Electricity_LED_GPIO GPIOB               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINBUTTON0_Electricity_LED_GPIO_PIN_MASK (1U << 5U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINBUTTON0_Electricity_LED_PORT PORTB               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINBUTTON0_Electricity_LED_PIN 5U                   /*!<@brief PORT pin number */
#define BOARD_INITPINBUTTON0_Electricity_LED_PIN_MASK (1U << 5U)      /*!<@brief PORT pin mask */
                                                                      /* @} */

/*! @name PORTC7 (number 45), L_LED
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINBUTTON0_L_LED_GPIO GPIOC               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINBUTTON0_L_LED_GPIO_PIN_MASK (1U << 7U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINBUTTON0_L_LED_PORT PORTC               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINBUTTON0_L_LED_PIN 7U                   /*!<@brief PORT pin number */
#define BOARD_INITPINBUTTON0_L_LED_PIN_MASK (1U << 7U)      /*!<@brief PORT pin mask */
                                                            /* @} */

/*! @name PORTA18 (number 13), T_LED
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINBUTTON0_T_LED_GPIO GPIOA                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINBUTTON0_T_LED_GPIO_PIN_MASK (1U << 18U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINBUTTON0_T_LED_PORT PORTA                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINBUTTON0_T_LED_PIN 18U                   /*!<@brief PORT pin number */
#define BOARD_INITPINBUTTON0_T_LED_PIN_MASK (1U << 18U)      /*!<@brief PORT pin mask */
                                                             /* @} */

/*! @name PORTA19 (number 14), P_LED
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINBUTTON0_P_LED_GPIO GPIOA                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINBUTTON0_P_LED_GPIO_PIN_MASK (1U << 19U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINBUTTON0_P_LED_PORT PORTA                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINBUTTON0_P_LED_PIN 19U                   /*!<@brief PORT pin number */
#define BOARD_INITPINBUTTON0_P_LED_PIN_MASK (1U << 19U)      /*!<@brief PORT pin mask */
                                                             /* @} */

/*! @name PORTD2 (number 25), BLE_LED
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINBUTTON0_BLE_LED_GPIO GPIOD               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINBUTTON0_BLE_LED_GPIO_PIN_MASK (1U << 2U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINBUTTON0_BLE_LED_PORT PORTD               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINBUTTON0_BLE_LED_PIN 2U                   /*!<@brief PORT pin number */
#define BOARD_INITPINBUTTON0_BLE_LED_PIN_MASK (1U << 2U)      /*!<@brief PORT pin mask */
                                                              /* @} */

/*! @name PORTC6 (number 44), electricity
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINBUTTON0_electricity_PORT PORTC               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINBUTTON0_electricity_PIN 6U                   /*!<@brief PORT pin number */
#define BOARD_INITPINBUTTON0_electricity_PIN_MASK (1U << 6U)      /*!<@brief PORT pin mask */
                                                                  /* @} */

/*! @name PORTB4 (number 2), ON
  @{ */

