Eloise-wang/BLE_DataCollection_New/ZKFJ_BLE_wireless_uart_freertos/board/pin_mux.h
/*! @name PORTD1 (number 24), Send_LED
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_UNINITPINBUTTON0_SW2_PORT PORTD               /*!<@brief PORT peripheral base pointer */
#define BOARD_UNINITPINBUTTON0_SW2_PIN 1U                   /*!<@brief PORT pin number */
#define BOARD_UNINITPINBUTTON0_SW2_PIN_MASK (1U << 1U)      /*!<@brief PORT pin mask */
                                                            /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_UnInitPinButton0(void);

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_UnInitPinSWO(void);

/*! @name PORTB0 (number 46), LED1/LPSPI1_PCS0
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_UNINITPINLED1_LED1_PORT PORTB               /*!<@brief PORT peripheral base pointer */
#define BOARD_UNINITPINLED1_LED1_PIN 0U                   /*!<@brief PORT pin number */
#define BOARD_UNINITPINLED1_LED1_PIN_MASK (1U << 0U)      /*!<@brief PORT pin mask */
                                                          /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_UnInitPinLED1(void);

/*! @name PORTA21 (number 18), pressure
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_UNINITPINLED2_LED_R_PORT PORTA                /*!<@brief PORT peripheral base pointer */
#define BOARD_UNINITPINLED2_LED_R_PIN 21U                   /*!<@brief PORT pin number */
#define BOARD_UNINITPINLED2_LED_R_PIN_MASK (1U << 21U)      /*!<@brief PORT pin mask */
                                                            /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_UnInitPinLED2(void);

/*! @name PORTA19 (number 14), P_LED
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_UNINITPINLED3_LED_G_PORT PORTA                /*!<@brief PORT peripheral base pointer */
#define BOARD_UNINITPINLED3_LED_G_PIN 19U                   /*!<@brief PORT pin number */
#define BOARD_UNINITPINLED3_LED_G_PIN_MASK (1U << 19U)      /*!<@brief PORT pin mask */
                                                            /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_UnInitPinLED3(void);

/*! @name PORTA20 (number 17), temp
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_UNINITPINLED4_LED_B_PORT PORTA                /*!<@brief PORT peripheral base pointer */
#define BOARD_UNINITPINLED4_LED_B_PIN 20U                   /*!<@brief PORT pin number */
#define BOARD_UNINITPINLED4_LED_B_PIN_MASK (1U << 20U)      /*!<@brief PORT pin mask */
                                                            /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_UnInitPinLED4(void);

/*! @name PORTB2 (number 48), SCK
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITEXTFLASHPINS_SCKSI_IO1_PORT PORTB               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITEXTFLASHPINS_SCKSI_IO1_PIN 2U                   /*!<@brief PORT pin number */
#define BOARD_INITEXTFLASHPINS_SCKSI_IO1_PIN_MASK (1U << 2U)      /*!<@brief PORT pin mask */
                                                                  /* @} */

/*! @name PORTB1 (number 47), SI_IO1/SI-IO1/SI-IO1
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITEXTFLASHPINS_SI_IO1_PORT PORTB               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITEXTFLASHPINS_SI_IO1_PIN 1U                   /*!<@brief PORT pin number */
#define BOARD_INITEXTFLASHPINS_SI_IO1_PIN_MASK (1U << 1U)      /*!<@brief PORT pin mask */
                                                               /* @} */

/*! @name PORTB3 (number 1), SO_IO1/SO-IO1/SO-IO1
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITEXTFLASHPINS_SO_IO1_PORT PORTB               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITEXTFLASHPINS_SO_IO1_PIN 3U                   /*!<@brief PORT pin number */
#define BOARD_INITEXTFLASHPINS_SO_IO1_PIN_MASK (1U << 3U)      /*!<@brief PORT pin mask */
                                                               /* @} */

/*! @name PORTB0 (number 46), LED1/LPSPI1_PCS0
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITEXTFLASHPINS_LPSPI1_PCS0_GPIO GPIOB               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITEXTFLASHPINS_LPSPI1_PCS0_INIT_GPIO_VALUE 1U       /*!<@brief GPIO output initial state */
#define BOARD_INITEXTFLASHPINS_LPSPI1_PCS0_GPIO_PIN_MASK (1U << 0U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITEXTFLASHPINS_LPSPI1_PCS0_PORT PORTB               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITEXTFLASHPINS_LPSPI1_PCS0_PIN 0U                   /*!<@brief PORT pin number */
#define BOARD_INITEXTFLASHPINS_LPSPI1_PCS0_PIN_MASK (1U << 0U)      /*!<@brief PORT pin mask */
                                                                    /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitExtFlashPins(void);

/*! @name PORTB0 (number 46), LED1/LPSPI1_PCS0
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_DEINITEXTFLASHPINS_LPSPI1_PCS0_GPIO GPIOB               /*!<@brief GPIO peripheral base pointer */
#define BOARD_DEINITEXTFLASHPINS_LPSPI1_PCS0_INIT_GPIO_VALUE 0U       /*!<@brief GPIO output initial state */
#define BOARD_DEINITEXTFLASHPINS_LPSPI1_PCS0_GPIO_PIN_MASK (1U << 0U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_DEINITEXTFLASHPINS_LPSPI1_PCS0_PORT PORTB               /*!<@brief PORT peripheral base pointer */
#define BOARD_DEINITEXTFLASHPINS_LPSPI1_PCS0_PIN 0U                   /*!<@brief PORT pin number */
#define BOARD_DEINITEXTFLASHPINS_LPSPI1_PCS0_PIN_MASK (1U << 0U)      /*!<@brief PORT pin mask */
                                                                      /* @} */

/*! @name PORTB1 (number 47), SI_IO1/SI-IO1/SI-IO1
  @{ */

