Eloise-wang/BLE_DataCollection_New/ZKFJ_BLE_wireless_uart_freertos/board/pin_mux.h
/* Symbols to be used with GPIO driver */
#define BOARD_DEINITEXTFLASHPINS_SI_IO1_GPIO GPIOB               /*!<@brief GPIO peripheral base pointer */
#define BOARD_DEINITEXTFLASHPINS_SI_IO1_GPIO_PIN_MASK (1U << 1U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_DEINITEXTFLASHPINS_SI_IO1_PORT PORTB               /*!<@brief PORT peripheral base pointer */
#define BOARD_DEINITEXTFLASHPINS_SI_IO1_PIN 1U                   /*!<@brief PORT pin number */
#define BOARD_DEINITEXTFLASHPINS_SI_IO1_PIN_MASK (1U << 1U)      /*!<@brief PORT pin mask */
                                                                 /* @} */

/*! @name PORTB2 (number 48), SCK
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_DEINITEXTFLASHPINS_SCKSI_IO1_GPIO GPIOB               /*!<@brief GPIO peripheral base pointer */
#define BOARD_DEINITEXTFLASHPINS_SCKSI_IO1_GPIO_PIN_MASK (1U << 2U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_DEINITEXTFLASHPINS_SCKSI_IO1_PORT PORTB               /*!<@brief PORT peripheral base pointer */
#define BOARD_DEINITEXTFLASHPINS_SCKSI_IO1_PIN 2U                   /*!<@brief PORT pin number */
#define BOARD_DEINITEXTFLASHPINS_SCKSI_IO1_PIN_MASK (1U << 2U)      /*!<@brief PORT pin mask */
                                                                    /* @} */

/*! @name PORTB3 (number 1), SO_IO1/SO-IO1/SO-IO1
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_DEINITEXTFLASHPINS_SO_IO1_GPIO GPIOB               /*!<@brief GPIO peripheral base pointer */
#define BOARD_DEINITEXTFLASHPINS_SO_IO1_GPIO_PIN_MASK (1U << 3U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_DEINITEXTFLASHPINS_SO_IO1_PORT PORTB               /*!<@brief PORT peripheral base pointer */
#define BOARD_DEINITEXTFLASHPINS_SO_IO1_PIN 3U                   /*!<@brief PORT pin number */
#define BOARD_DEINITEXTFLASHPINS_SO_IO1_PIN_MASK (1U << 3U)      /*!<@brief PORT pin mask */
                                                                 /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_DeinitExtFlashPins(void);

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPinLPUART0_RTS(void);

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPinLPUART0_CTS(void);

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_UnInitPinLPUART0_RTS(void);

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_UnInitPinLPUART0_CTS(void);

/*!
 * @brief Configures pin routing, Disable pin 10 for leakage reduction in low power mode.
 *
 */
void BOARD_InitPins(void);

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
